<script setup>

</script>

<template>
  <div class="flex flex-col text-[20px] ml-24 mt-14 pr-20">
    <h2 class="text-[24px]">Приготовление</h2>


    <ul class="list-decimal font-semibold pl-6 text-[20px] ml-10 mt-7 mb-16">
      <li class="mb-12">Основа
        <ul class="list-decimal font-normal pl-6 mt-1">
          <li>Измельчи печенье в крошку (в блендере или скалкой).</li>
          <li>Растопи сливочное масло и смешай с крошкой (и сахаром, если используешь).</li>
          <li>Утрамбуй массу в форму, выстеленную пергаментом (дно и немного стенки).</li>
          <li>Убери в холодильник минимум на 20 минут (или поставь в духовку на 10 минут при 180°C, если хочешь более хрустящую корочку).</li>
        </ul>
      </li>

      <li class="">Сырная начинка</li>
      <ul class="list-decimal font-normal pl-6 mt-1 mb-12">
        <li>В большой миске размягчи сливочный сыр до кремовой консистенции.</li>
        <li>Добавь сахар, ваниль, соль и крахмал. Хорошо перемешай (на низкой скорости, не взбивай сильно — чтобы не было пузырей).</li>
        <li>Добавь яйца по одному, аккуратно вмешивая каждое.</li>
        <li>Вмешай сметану и цедру лимона (если используешь).</li>
        <li>Вылей массу в подготовленную основу.</li>
      </ul>

      <li>Выпечка</li>
      <ul class="list-decimal font-normal pl-6 mt-1">
        <li>В большой миске размягчи сливочный сыр до кремовой консистенции.</li>
        <li>Добавь сахар, ваниль, соль и крахмал. Хорошо перемешай (на низкой скорости, не взбивай сильно — чтобы не было пузырей).</li>
        <li>Добавь яйца по одному, аккуратно вмешивая каждое.</li>
        <li>Вмешай сметану и цедру лимона (если используешь).</li>
        <li>Вылей массу в подготовленную основу.</li>
      </ul>
    </ul>

    <div>
      <h2 class="text-[24px] ">Подача</h2>
      <h3 class="ml-10 mt-5 mb-12">Подавай с ягодами, вареньем, карамельным или шоколадным соусом. Особенно вкусно с малиновым пюре или кислой вишней!</h3>
    </div>


  </div>
</template>
