<script setup>

import RecipesItem from '@/components/RecipesItem.vue'
import { useRoute } from 'vue-router'




const headers = [
  {label: "Первые блюда", description: "Первые блюда занимают особое место в традиционной кухне многих стран. Эти блюда играют важную роль в питании, они обычно подаются в начале трапезы и служат как разогревающая и насыщенная основа для основного приема пищи. Включают в себя супы, бульоны, окрошку, пюре и многие другие блюда, которые часто готовятся на основе жидкой основы (бульон, вода, молоко, овощной отвар). Они могут быть как легкими, так и сытными, в зависимости от состава и метода приготовления."},
  {label: "Вторые блюда", description: "Вторые блюда — это основная часть обеда или ужина, которая обычно служит для насыщения организма и состоит из более сытных и калорийных продуктов. Эти блюда могут быть как мясными, так и вегетарианскими, и включают в себя гарниры, основные мясные и рыбные блюда, пасту и другие продукты, которые можно приготовить различными способами: жаркой, тушением, запеканием или варкой.\n" +
      "Вторые блюда занимают важное место в меню, так как именно они дают организму необходимое количество энергии и белка. Они часто являются кульминацией кулинарного процесса, поскольку включают более сложные и питательные компоненты."},
  {label: "Закуски", description: "Закуски — это небольшие порции пищи, которые подаются перед основным блюдом или в качестве дополнения к нему. Закуски могут быть холодными или горячими, легкими или сытными, и часто включают в себя разнообразие вкусов и текстур. Они играют важную роль на любом праздничном столе, так как могут быть как самостоятельными блюдами, так и сопровождать основное блюдо, создавая разнообразие на столе."},
  {label: "Десерты", description: "Десерты — это сладкие блюда, которые традиционно подаются в конце основного приема пищи. Они могут быть как легкими и воздушными, так и сытными и калорийными. Десерты могут быть приготовлены из множества ингредиентов, таких как фрукты, ягоды, шоколад, молочные продукты, сахар и различные добавки, такие как орехи, специи и сиропы. В зависимости от состава и способа приготовления, десерты могут быть холодными или горячими, с использованием печеных, замороженных или даже сырых компонентов.\n" +
      "Десерты не только радуют глаз, но и создают приятное завершение трапезы, помогая расслабиться и получить удовольствие от пищи. В разных культурах мира существуют свои традиции и рецепты десертов, которые часто отражают местные вкусовые предпочтения и кулинарные особенности."}
]

const labelMap = {
  "первое": 0,
  "второе": 1,
  "закуски": 2,
  "десерты": 3
}


const currentCategory = headers[labelMap[useRoute().params.label]]

const dishes = [
  {label: "Тыквенный крем-суп", time: "40-50 минут", img: "pumpkin_soup.png", category: "первое"},
  {label: "Суп солянка", time: "1.5-2 часа", img: "solyanka.png", category: "первое"},
  {label: "Грибной бульон", time: "1-1.5 часа", img: "mushroom.png", category: "первое"},
  {label: "Куриный бульон", time: "1.5-2 часа", img: "chicken.png", category: "первое"},
  {label: "Окрошка на кефире", time: "20-30 минут", img: "okroshka.png", category: "первое"},
  {label: "Борщ с говядиной", time: "2-2.5 часа", img: "borsch.png", category: "первое"},
  {label: "Карбонара", time: "20-30 минут", img: "carbonara.png", category: "второе"},
  {label: "Пельмени", time: "1.5-2 часа", img: "dumplings.png", category: "второе"},
  {label: "Мясо по-франзцуски", time: "1.5-2 часа", img: "french_meat.png", category: "второе"},
  {label: "Говяжий стейк", time: "5-15 минут", img: "steak.png", category: "второе"},
  {label: "Лазанья", time: "1.5-2 часа", img: "lasagna.png", category: "второе"},
  {label: "Блинчики с мясом", time: "1-1.5 часа", img: "meat_pancakes.png", category: "второе"},
  {label: "Кростини", time: "15-20 минут", img: "crostini.png", category: "закуски"},
  {label: "Шарики из крабовых палочек в сырной панировке", time: "30-40 минут", img: "crab.png", category: "закуски"},
  {label: "Свекольные пхали", time: "1-1.5 часа", img: "phali.png", category: "закуски"},
  {label: "Рулет из лаваша с красной рыбой и латуком", time: "20-30 минут", img: "roll.png", category: "закуски"},
  {label: "Овощные канапе с сыром", time: "20-30 минут", img: "canape.png", category: "закуски"},
  {label: "Гуакамоле с авокадо", time: "10-15 минут", img: "guacamole.png", category: "закуски"},
  {label: "Пахлава", time: "2-3 часа", img: "pahlava.png", category: "десерты"},
  {label: "Чизкейк", time: "4-5 часов", img: "cheesecake.png", category: "десерты"},
  {label: "Ванильное мороженое", time: "4–6 часов", img: "vanile_icecream.png", category: "десерты"},
  {label: "Круассаны с шоколадом", time: "4-5 часов", img: "croissant.png", category: "десерты"},
  {label: "Пирог с вишней", time: "1,5–2 часа", img: "chery_pie.png", category: "десерты"},
  {label: "Капкейки", time: "около 1 часа", img: "cupcake.png", category: "десерты"},

]

const currentCategoryDishes = dishes.filter((dish) => dish.category === useRoute().params.label)

</script>

<template>
  <div class="pt-16 max-sm:text-center">
    <h1 class="text-[96px] max-sm:text-[60px] text-center">{{currentCategory.label}}</h1>
    <h3 class="text-[24px] px-36 max-md:px-10 max-sm:text-[18px] pt-8">{{currentCategory.description}}</h3>
  </div>

  <div class="grid grid-cols-2 max-lg:grid-cols-1 gap-10 p-24 max-sm:p-12 pb-4">
    <RecipesItem
        class=""
      v-for="(item, index) in currentCategoryDishes"
      :key="index"
      :img="item.img"
      :label="item.label"
      :time="item.time"
      />
  </div>
</template>

<style scoped>

</style>