<script setup>

import TheRecipesBanner from '@/components/TheRecipesBanner.vue'

const banners = [
  { img: '/src/assets/img/first.png', label: 'первое' },
  { img: '/src/assets/img/second.png', label: 'второе' },
  { img: '/src/assets/img/snacks.png', label: 'закуски' },
  { img: '/src/assets/img/deserts.png', label: 'десерты' },
];
</script>

<template>
  <h2 class="p-16 text-[20px]">Кулинария — это искусство и наука приготовления пищи, которая охватывает широкий спектр техник, методов и рецептов для создания вкусных и питательных блюд. Включая в себя все этапы от выбора ингредиентов до сервировки, кулинария сочетает в себе творческий подход, технику и знание химических процессов, происходящих в пище во время приготовления. Это многогранное искусство, которое сочетает в себе творчество, науку и традиции. Она развивается в ответ на изменения в образе жизни, культуре и технологиях, и находит новые способы адаптации к потребностям современного общества. Независимо от того, идет ли речь о традиционных блюдах, инновационных кулинарных техниках или здоровом питании, кулинария остается важной частью жизни людей по всему миру.</h2>
  <h1 class="text-center text-[28px] mb-10">Пожалуйста, уточните какой рецепт вам нужен</h1>
  <TheRecipesBanner
    v-for="(item, index) in banners"
    :key="index"
    :img="item.img"
    :label="item.label"
  />
</template>

<style scoped>

</style>